app/controllers/admin_main_page_controller.rb

SELECT "logins".* FROM "logins" ORDER BY username
---
	def home
		 @list=Login.order("username")

SELECT "logins".* FROM "logins" ORDER BY "logins"."id" DESC LIMIT 1
SELECT "genders".* FROM "genders" WHERE "genders"."id" = 1 LIMIT 1
SELECT "nationalities".* FROM "nationalities" WHERE "nationalities"."id" = 1 LIMIT 1
SELECT "regions".* FROM "regions" WHERE "regions"."id" = 1 LIMIT 1
SELECT "blood_groups".* FROM "blood_groups" WHERE "blood_groups"."id" = 1 LIMIT 1
---
	def new_reg
        session[:selected_tab] = "home"

		@d= Date.today
		@emp_id = Login.last
       	@inc_val = @emp_id.emp_id + 1
		@gender=Gender.find(:all)
		@employee_detail = Login.new
		@login =Login.new
		@nationlities=Nationality.find(:all)
		@region=Region.find(:all)
		@blood_group=BloodGroup.find(:all)

INSERT INTO "logins" ("admission_date", "adress", "bank_acc_no", "basic_salary", "blood_group_id", "created_at", "dob", "email", "emp_id", "employee_type", "gender_id", "nationality_id", "password", "phone_no", "photo_content_type", "photo_file_name", "photo_file_size", "photo_updated_at", "region_id", "resume_content_type", "resume_file_name", "resume_file_size", "resume_updated_at", "updated_at", "username") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17, $18, $19, $20, $21, $22, $23, $24, $25) RETURNING "id"
SELECT "logins".* FROM "logins" ORDER BY "logins"."id" DESC LIMIT 1
---
	def save
   raise params.inspect
		@login=Login.new(params[:login])
		status=@login.save
		if status
		redirect_to :controller=>'/admin_main_page', :action => 'new_reg'
		else
		@d= Date.today
		@emp_id = Login.last

SELECT "logins".* FROM "logins" LIMIT 3 OFFSET 0
SELECT COUNT(*) FROM "logins"
---
	def list_of_emp
		@list_of_emp = Login.paginate(:page => params[:page],:per_page => 10)

SELECT "logins".* FROM "logins" WHERE "logins"."id" = 3 LIMIT 1
---
	def edit
		@login= Login.where(:id => params[:user_id].to_i).first