app/controllers/admin_main_page_controller.rb

SELECT "logins".* FROM "logins" WHERE (3)
---
	def new_reg



		@d= Date.today
		@emp_id = Login.last
       	@inc_val = @emp_id.emp_id + 1
		@gender=Gender.find(:all)
		@employee_detail = Login.new
		@login = params[:employee_detail].blank? ? Login.new : Login.new(params[:employee_detail])

INSERT INTO "banks" ("acc_no", "balance", "created_at", "name", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["acc_no", 191212], ["balance", nil], ["created_at", Wed, 19 Dec 2012 07:26:19 UTC +00:00], ["name", "jjjjjjjww"], ["updated_at", Wed, 19 Dec 2012 07:26:19 UTC +00:00]]
---
	def save
		@login=Login.new(params[:employee_detail])

		bank_status=Bank.create_bank_account(params[:employee_detail])