app/controllers/login_controller.rb

    def goto_login

       if params[:login][:usertype] =="employee"
            @login_check=Login.where(:username => params[:user_name_field] , :password => params[:password_field]).first
            if !@login_check.blank?
            redirect_to :controller=>'/main_page', :action => 'show',:user_id=>@login_check
            else
            redirect_to(root_url,:notice => 'Please Enter Valid User Name/Password')
            end
       elsif params[:login][:usertype] =="admin"
            @login_check=Login.where(:username => params[:user_name_field] , :password => params[:password_field],:employee_type=>"HR").first
---
SELECT "logins".* FROM "logins" WHERE "logins"."username" = 'prakash' AND "logins"."password" = 'prakashm' LIMIT 1
SELECT "logins".* FROM "logins" WHERE "logins"."username" = 'jayaprakash' AND "logins"."password" = 'suresh' AND "logins"."employee_type" = 'HR' LIMIT 1

    def forgot_password
       @email =  Login.where('email =?',params[:login][:email]).first
---
SELECT "logins".* FROM "logins" WHERE "logins"."email" = 'hgh@jhaaaj.com' LIMIT 1